artillery.yml
config:
  target: "http://localhost:3000"
  socketio:
    transports: ["websocket"]
  phases:
    - duration: 120
      arrivalRate: 10
      rampTo: 50
    - duration: 180
      arrivalRate: 50

scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "join-room"
          data:
            roomId: "Room123"
            message: "Joined Room123"
      - loop:
          - emit:
              channel: "send-chat"
              data:
                roomId: "Room123"
                message: "Chatting in Room123"
          - think: 1
        count: 5

      - emit:
          channel: "leave-room"
          data:
            roomId: "Room123"
            message: "Left Room123"